XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/uart.c
/*******************************************************************************
 * @defgroup 串口4
 * @{
 */

#ifdef EN_UART4
UART_HandleTypeDef g_uart4_handle = {0};
#if EN_UART4_RX
#if !UART4_USE_DMA_RX
uint8_t g_uart4_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart4_rx_status = 0;
static uint8_t g_uart4_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART4_USE_DMA_RX */
/**
 * @brief 串口4中断服务函数
 */
void UART4_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if UART4_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_uart4_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_uart4_handle);
        uart_dmarx_idle_callback(&g_uart4_handle);
    }
#endif /* UART4_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_uart4_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART4_RX */
/**
 * @brief 串口4初始化
 * @param bound 波特率
 */
void uart4_init(uint32_t bound) {
    g_uart4_handle.Instance = UART4;
    g_uart4_handle.Init.BaudRate = bound;
    g_uart4_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart4_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart4_handle.Init.Parity = UART_PARITY_NONE;
    g_uart4_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart4_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart4_handle);

#if UART4_USE_DMA_TX
    /* 打开DMA发送 */
    uart4_dmatx_init(2048, 128);
#endif /* UART4_USE_DMA_TX */

#if EN_UART4_RX
#if UART4_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart4_dmarx_init(4096, 128);
#else  /* UART4_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_uart4_handle, (uint8_t *)g_uart4_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART4_USE_DMA_RX */
#endif /* EN_UART4_RX */
}
#endif /* EN_UART4 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口5
 * @{
 */

#ifdef EN_UART5
UART_HandleTypeDef g_uart5_handle = {0};
#if EN_UART5_RX
#if !UART5_USE_DMA_RX
uint8_t g_uart5_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart5_rx_status = 0;
static uint8_t g_uart5_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART5_USE_DMA_RX */
/**
 * @brief 串口5中断服务函数
 */
void UART5_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if UART5_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_uart5_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_uart5_handle);
        uart_dmarx_idle_callback(&g_uart5_handle);
    }
#endif /* UART5_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_uart5_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART5_RX */
/**
 * @brief 串口5初始化
 * @param bound 波特率
 */
void uart5_init(uint32_t bound) {
    g_uart5_handle.Instance = UART5;
    g_uart5_handle.Init.BaudRate = bound;
    g_uart5_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart5_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart5_handle.Init.Parity = UART_PARITY_NONE;
    g_uart5_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart5_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart5_handle);

#if UART5_USE_DMA_TX
    /* 打开DMA发送 */
    uart5_dmatx_init(2048, 128);
#endif /* UART5_USE_DMA_TX */

#if EN_UART5_RX
#if UART5_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart5_dmarx_init(4096, 128);
#else  /* UART5_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_uart5_handle, (uint8_t *)g_uart5_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART5_USE_DMA_RX */
#endif /* EN_UART5_RX */
}
#endif /* EN_UART5 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口6
 * @{
 */

#ifdef EN_USART6
UART_HandleTypeDef g_usart6_handle = {0};
#if EN_USART6_RX
#if !USART6_USE_DMA_RX
uint8_t g_usart6_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_usart6_rx_status = 0;
static uint8_t g_usart6_recv_it_buf[RECV_IT_BUF_SIZE];
#endif /* !USART6_USE_DMA_RX */
/**
 * @brief 串口6中断服务函数
 */
void USART6_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if USART6_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_usart6_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_usart6_handle);
        uart_dmarx_idle_callback(&g_usart6_handle);
    }
#endif /* USART6_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_usart6_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_USART6_RX */
/**
 * @brief 串口6初始化
 * @param bound 波特率
 */
void usart6_init(uint32_t bound) {
    g_usart6_handle.Instance = USART6;
    g_usart6_handle.Init.BaudRate = bound;
    g_usart6_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_usart6_handle.Init.StopBits = UART_STOPBITS_1;
    g_usart6_handle.Init.Parity = UART_PARITY_NONE;
    g_usart6_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_usart6_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_usart6_handle);

#if USART6_USE_DMA_TX
    /* 打开DMA发送 */
    usart6_dmatx_init(2048, 128);
#endif /* USART6_USE_DMA_TX */

#if EN_USART6_RX
#if USART6_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    usart6_dmarx_init(4096, 128);
#else  /* USART6_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_usart6_handle, (uint8_t *)g_usart6_recv_it_buf,
                        RECV_IT_BUF_SIZE);
#endif /* USART6_USE_DMA_RX */
#endif /* EN_USART6_RX */
}
#endif /* EN_USART6 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口7
 * @{
 */

#ifdef EN_UART7
UART_HandleTypeDef g_uart7_handle = {0};
#if EN_UART7_RX
#if !UART7_USE_DMA_RX
uint8_t g_uart7_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart7_rx_status = 0;
static uint8_t g_uart7_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART7_USE_DMA_RX */
/**
 * @brief 串口7中断服务函数
 */
void UART7_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if UART7_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_uart7_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_uart7_handle);
        uart_dmarx_idle_callback(&g_uart7_handle);
    }
#endif /* UART7_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_uart7_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART7_RX */
/**
 * @brief 串口7初始化
 * @param bound 波特率
 */
void uart7_init(uint32_t bound) {
    g_uart7_handle.Instance = UART7;
    g_uart7_handle.Init.BaudRate = bound;
    g_uart7_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart7_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart7_handle.Init.Parity = UART_PARITY_NONE;
    g_uart7_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart7_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart7_handle);

#if UART7_USE_DMA_TX
    /* 打开DMA发送 */
    uart7_dmatx_init(2048, 128);
#endif /* UART7_USE_DMA_TX */

#if EN_UART7_RX
#if UART7_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart7_dmarx_init(4096, 128);
#else  /* UART7_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_uart7_handle, (uint8_t *)g_uart7_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART7_USE_DMA_RX */
#endif /* EN_UART7_RX */
}
#endif /* EN_UART7 */

/**
 * @}
 */

