XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/uart.c
/*******************************************************************************
 * @defgroup 串口8
 * @{
 */

#ifdef EN_UART8
UART_HandleTypeDef g_uart8_handle = {0};
#if EN_UART8_RX
#if !UART8_USE_DMA_RX
uint8_t g_uart8_rx_buf[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t g_uart8_rx_status = 0;
static uint8_t g_uart8_recv_buf[RECV_IT_BUF_SIZE];
#endif /* !UART8_USE_DMA_RX */
/**
 * @brief 串口8中断服务函数
 */
void UART8_IRQHandler(void) {
#if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
#endif /* SYS_SUPPORT_OS */

#if UART8_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&g_uart8_handle, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&g_uart8_handle);
        uart_dmarx_idle_callback(&g_uart8_handle);
    }
#endif /* UART8_USE_IDLE_IT */

    HAL_UART_IRQHandler(&g_uart8_handle); /* 调用HAL库中断处理公用函数 */

#if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
#endif /* SYS_SUPPORT_OS */
}
#endif /* EN_UART8_RX */
/**
 * @brief 串口8初始化
 * @param bound 波特率
 */
void uart8_init(uint32_t bound) {
    g_uart8_handle.Instance = UART8;
    g_uart8_handle.Init.BaudRate = bound;
    g_uart8_handle.Init.WordLength = UART_WORDLENGTH_8B;
    g_uart8_handle.Init.StopBits = UART_STOPBITS_1;
    g_uart8_handle.Init.Parity = UART_PARITY_NONE;
    g_uart8_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_uart8_handle.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&g_uart8_handle);

#if UART8_USE_DMA_TX
    /* 打开DMA发送 */
    uart8_dmatx_init(2048, 128);
#endif /* UART8_USE_DMA_TX */

#if EN_UART8_RX
#if UART8_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    uart8_dmarx_init(4096, 128);
#else  /* UART8_USE_DMA_RX */
    HAL_UART_Receive_IT(&g_uart8_handle, (uint8_t *)g_uart8_recv_buf,
                        RECV_IT_BUF_SIZE);
#endif /* UART8_USE_DMA_RX */
#endif /* EN_UART8_RX */
}
#endif /* EN_UART8 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 公共处理函数
 * @{
 */

/**
 * @brief 串口底层驱动函数
 *
 * @param huart 串口句柄
 */
void HAL_UART_MspInit(UART_HandleTypeDef *huart) {
    GPIO_InitTypeDef GPIO_Initure = {0};
    if (huart->Instance == USART1) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_USART1_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_9;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF7_USART1;
        HAL_GPIO_Init(GPIOA, &GPIO_Initure); /* PA9 */
        GPIO_Initure.Pin = GPIO_PIN_10;
        HAL_GPIO_Init(GPIOA, &GPIO_Initure); /* PA10 */
#if EN_USART1_RX
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        HAL_NVIC_SetPriority(USART1_IRQn, 2, 2);
#endif /* EN_USART1_RX */
    } else if (huart->Instance == USART2) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_USART2_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_2;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF7_USART2;
        HAL_GPIO_Init(GPIOA, &GPIO_Initure); /* PA2 */
        GPIO_Initure.Pin = GPIO_PIN_3;
        HAL_GPIO_Init(GPIOA, &GPIO_Initure); /* PA3 */
#if EN_USART2_RX
        HAL_NVIC_EnableIRQ(USART2_IRQn);
        HAL_NVIC_SetPriority(USART2_IRQn, 2, 2);
#endif /* EN_USART2_RX */
    } else if (huart->Instance == USART3) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_USART3_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_10;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF7_USART3;
        HAL_GPIO_Init(GPIOB, &GPIO_Initure); /* PB10 */
        GPIO_Initure.Pin = GPIO_PIN_11;
        HAL_GPIO_Init(GPIOB, &GPIO_Initure); /* PB11 */
#if EN_USART3_RX
        HAL_NVIC_EnableIRQ(USART3_IRQn);
        HAL_NVIC_SetPriority(USART3_IRQn, 2, 2);
#endif /* EN_USART3_RX */
    } else if (huart->Instance == UART4) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_UART4_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_10;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF8_UART4;
        HAL_GPIO_Init(GPIOC, &GPIO_Initure); /* PC10 */
        GPIO_Initure.Pin = GPIO_PIN_11;
        HAL_GPIO_Init(GPIOC, &GPIO_Initure); /* PC11 */
#if EN_UART4_RX
        HAL_NVIC_EnableIRQ(UART4_IRQn);
        HAL_NVIC_SetPriority(UART4_IRQn, 2, 2);
#endif /* EN_UART4_RX */
    } else if (huart->Instance == UART5) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_UART5_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_12;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF8_UART5;
        HAL_GPIO_Init(GPIOC, &GPIO_Initure); /* PC12 */
        GPIO_Initure.Pin = GPIO_PIN_2;
        HAL_GPIO_Init(GPIOD, &GPIO_Initure); /* PD2 */
#if EN_UART5_RX
        HAL_NVIC_EnableIRQ(UART5_IRQn);
        HAL_NVIC_SetPriority(UART5_IRQn, 2, 2);
#endif /* EN_UART5_RX */
    } else if (huart->Instance == USART6) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_USART6_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_6;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF8_USART6;
        HAL_GPIO_Init(GPIOC, &GPIO_Initure); /* PC6 */
        GPIO_Initure.Pin = GPIO_PIN_7;
        HAL_GPIO_Init(GPIOC, &GPIO_Initure); /* PC7 */
#if EN_USART6_RX
        HAL_NVIC_EnableIRQ(USART6_IRQn);
        HAL_NVIC_SetPriority(USART6_IRQn, 2, 2);
#endif /* EN_USART6_RX */
    } else if (huart->Instance == UART7) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_UART7_CLK_ENABLE();

        GPIO_Initure.Pin = GPIO_PIN_8;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF8_UART7;
        HAL_GPIO_Init(GPIOE, &GPIO_Initure); /* PE8 */
        GPIO_Initure.Pin = GPIO_PIN_7;
        HAL_GPIO_Init(GPIOE, &GPIO_Initure); /* PE7 */
#if EN_UART7_RX
        HAL_NVIC_EnableIRQ(UART7_IRQn);
        HAL_NVIC_SetPriority(UART7_IRQn, 2, 2);
#endif /* EN_UART7_RX */
    } else if (huart->Instance == UART8) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_UART8_CLK_ENABLE();

